<template>
  <div class="hello">
    <h1>第三届魔都日麻高校个人赛选手及负责人须知</h1>
    <h2>0.	写在前面</h2>
    <p>赛事网站：http://47.100.50.175:8080</p> 
    <p>因为服务器性能原因，第一次加载可能会稍慢。请使用PC或分辨率大于720p的横屏显示设备进行访问。</p>
    <h2>1.	概况</h2>
    <p>本次比赛共有22所高校（20所上海高校和2所上海周边高校）参加。</p> 
    <p>本次比赛使用雀魂平台，请各位选手在参赛前先进行注册。</p> 
    <p>本次比赛赛程从10月25日~11月10日，周六周日进行比赛。（预赛从周五开始）</p> 
    <h2>2.	报名</h2>
    <p>各高校队员联系高校负责人进行报名，截止日期为10月21日00:00。</p> 
    <p>负责人使用负责人账号（稍后将发送到各负责人的邮箱）登录后，进入网站管理界面——添加新队员，即可创建一个空的比赛账号。选手登录比赛账号后，进行信息填写即可正常参与比赛。请您注意修改初始密码，并保管好您的账号密码。</p> 
    <p><a style="color: red">每所高校最多能报名10人</a>（参赛选手须是所在高校的在校生或是毕业生，本次比赛不限制毕业生数量），负责人账号无法参加比赛。若负责人想参加比赛，请自行创建一个新的比赛账号。</p> 
    <p>参赛学校及负责人名单：</p> 
    <el-table
      :data="schools"
      style="margin-left: 20px; width: 480px">
      <el-table-column
        prop="school"
        label="学校"
        width="240">
      </el-table-column>
      <el-table-column
        prop="nickname"
        label="负责人昵称"
        width="240">
      </el-table-column>
    </el-table>
    <p>关于报名相关疑问请找本次主办：水鱼(QQ：2300756578)进行咨询。</p>
    <h2>3.	赛程及赛制</h2>
    <p>预选：</p>
    <p>X进64：10月25/26日19:00 ~ 23:00</p>
    <p>正赛：</p>
    <p>64进32：10月27日19:00 ~</p> 
    <p>32进16：11月2日19:00 ~</p> 
    <p>16进8：11月3日19:00 ~</p> 
    <p>8进4：11月9日19:00 ~</p> 
    <p>决赛：11月10日19:00 ~</p> 
    <p>预选阶段，选手将在规定时间内自行在大会室进行预约，人满即开，每人只能打<a style="color: red">6个半庄</a>，所有选手通过6个半庄的马点之和进行排名，前64的选手晋级，未能打满6个半庄的选手默认淘汰。</p>
    <p>所有晋级选手必须在比赛日18:00~18:30之间进行签到，签到后将进行分桌。</p>
    <p>无法签到请提前告知自己的负责人，正赛开始后10分钟内未到挂模切处理。</p>
    <p>正赛比赛开始为预选马点顺位排名（即瑞士制，高高碰）进行第一轮比赛，全部桌结束后根据当前马点顺位进行第二轮比赛，依此进行四轮比赛后，最终取前32/16/8/4，进入下一个阶段。决赛通过5个半庄的马点之和进行排名，决出冠亚季殿军。</p>
    <h2>4.  比赛规则</h2>
    <p>除无便捷提示外，规则和雀魂段位场相同。具体如下：</p>
    <p>原点：25000</p>
    <p>1位必要点数：30000</p>
    <p>返点：25000</p>
    <p>立直供托1000点，场棒300点，不听罚符累计3000点。</p>
    <p>顺位马：+15，+5，-5，-15。</p>
    <p>赤宝牌数量：3</p>
    <p><a style="color: red">无西入</a>，有一发，有杠宝牌、里宝牌，有击飞，有四风连打、四杠散了、四家立直、九种九牌流局，有流局满贯和多倍役满。</p>
    <p>无头跳，无三家和了流局。</p>
    <p>亲家和牌、听牌连庄；满足终局要求后亲家和牌、听牌终局。</p>
    <p>马点计算公式：(结算点数-25000)/1000+顺位马。例如选手A以33400点拿到2位，选手A本局的马点即为(33400-25000)/1000+5=+13.4。</p> 
    <h2>5.	奖品</h2>
    <p>冠军：订制奖杯+待定</p> 
    <p>亚军：订制奖杯+待定</p> 
    <p>季军：订制奖杯+待定</p> 
    <p>殿军：待定</p> 
    <p>5-8：待定</p> 
    <p>9-16：有没有目前待定</p> 
    <h2>6.	其他</h2>
    <p>本次比赛严禁任何不正打行为，包括但不限于代打、通牌，一经发现，立即取消该选手比赛资格。</p> 
    <p>报名/比赛过程中若有任何疑问，可以联系各高校负责人，或联系主办水鱼（QQ:2300756578），有赞助想法请联系安然（QQ:513696293)。</p>
    <p>本须知最终解释权归日麻高校个人赛组委会所有。</p> 
  </div>
</template>

<script>
export default {
  data() {
    return {
      schools: [
        {school: "华东师范大学", nickname: "czh", qq: "1158915441"},
        {school: "上海外国语大学", nickname: "二戸鈴", qq: "785137272"},
        {school: "复旦大学", nickname: "taku", qq: "374095644"},
        {school: "上海大学", nickname: "呆轩", qq: "939918608"},
        {school: "上海海事大学", nickname: "山风", qq: "675946979"},
        {school: "上海对外经贸大学", nickname: "檀檀", qq: "1297244236"},
        {school: "上海应用技术大学", nickname: "勇士", qq: "1211445112"},
        {school: "上海工程技术大学", nickname: "南浦", qq: "396335709"},
        {school: "上海财经大学", nickname: "飞啊飞", qq: "1318250776"},
        {school: "上海理工大学", nickname: "鸡腿", qq: "982919014"},
        {school: "浙江大学", nickname: "Sapphire ", qq: "1035627110"},
        {school: "上海政法学院", nickname: "T妹", qq: "844768831"},
        {school: "华东政法大学", nickname: "清风沐璃", qq: "2258349120"},
        {school: "上海立信会计金融学院", nickname: "哲学", qq: "1005536376"},
        {school: "上海电力大学", nickname: "qb", qq: "1499227861"},
        {school: "南京大学", nickname: "简单", qq: "514405488"},
        {school: "华东理工大学", nickname: "云", qq: "491445219"},
        {school: "上海海洋大学", nickname: "MrCrystalJoker", qq: "2267926518"},
        {school: "上海师范大学", nickname: "未来", qq: "974020665"},
        {school: "上海交通大学", nickname: "水鱼", qq: "2300756578"},
        {school: "东华大学", nickname: "梦境无恒", qq: "862919793"},
        {school: "上海电机学院", nickname: "树哥", qq: "1067668604"},
        {school: "学院路联合大学", nickname: "小弓"},
        {school: "东南大学", nickname:"Mew's"}
      ]
    }
  },
  name: "HelloWorld",
  props: {
    msg: String
  }
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
p {
  margin-left: 20px;
}
h1 {
  font-size: 2em;
}
ul {
  list-style-type: none;
  padding: 0;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
</style>
