<template>
  <div class="hello">
    <p></p>
    <h3>一． 比赛主旨</h3>
    <p>本次比赛与上次一样是对应联机群雀魂部的常规赛事，本意是娱乐比赛，增进友谊，提升技术（雀力）？且这次与贴吧吧务特别联合，举办的大型赛事。为什么是三麻？因为四麻不是刚办过吗，233。对雀魂群有兴趣的小伙伴快进群玩呀（群号663611702必要活跃哦）</p>
    <h3>二． 报名相关</h3>
    <p>比赛类型：特殊团队赛 三麻团队赛</p>
    <p>比赛平台：雀魂麻将</p>
    <p>赛事规模：大型</p>
    <p>队内人数要求：每个团队人数3-5人，每个团队参赛人数3人</p>
    <p>分为: 先锋，中坚，大将， 替补（0-2人）且必选一个队长</p>
    <p>总人数要求：参赛总人数240人以上(要有80个以上团队进行比赛)</p>
    <p>报名限制：可以自行组队报名或者自己报名且随机分配队友</p>
    <p>自组队3-5人 自报名只分配3人且自行分配入场顺序</p>
    <p>报名费用：免费（如果要赞助比赛的也可以给哈，全部计入奖励）</p>
    <p>报名方式：1.加入群733175185（队长必加）</p>
    <p>2.？？</p>
    <p>报名截止时间：8月日0：00</p>
    <h3>三． 奖励相关（暂定）</h3>
    <p>奖品预留（现金奖励自队内自定分配~）</p>
    <p>第一位：现金1000</p>
    <p>第二位：现金500</p>
    <p>第三位：现金200</p>
    <p>4-6位：100元</p>
    <p>特殊奖：完成两倍役满牌谱给予景品手办奖励 最多三个 先到先得</p>
    <p>*景品手办的价格在150-250之间</p>
    <h3>四． 比赛规程（重要）</h3>
    <p>1 . 本次采用区域赛形势进行，参赛选手会被分入四个区域，分别是东 南 西 北 区，每个区域晋级三个队伍，最后的12个队伍会在主赛场进行角逐。</p>
    <p>2.本次比赛时间为13天</p>
    <p>3 .分区区域赛：分为海选赛->初赛->复赛->复活赛</p>
    <p>复赛晋级2队，复活赛晋级1队</p>
    <p>海选赛：8月12号 19:30-21:30 排位制 前二晋级初赛，其他淘汰</p>
    <p>初赛： 8月14号 19:30-21:30 积分制 前三晋级，其他入败者组</p>
    <p>复赛： 8月16号 15:00-17:30 排位制 前二晋级，其他入败者组</p>
    <p>复活赛：8月18号 19:30-21:00 积分制 第一晋级，其他淘汰</p>
    <p>补赛： 8月13号-19号 全天 ----- （特殊情况加赛）</p>
    <p>3．主赛区域赛：积分循环赛->决赛</p>
    <p>积分循环赛： 8月23号 15:00-17:00 20:00-21:30 1，2轮</p>
    <p>8月24号 15:00-17:00 20:00-21:30 3，4轮</p>
    <p>积分前三晋级决赛</p>
    <p>决赛： 8月25号 19:30-21:30</p>
    <h3>五． 参赛规则（重要）</h3>
    <p>请每个队伍的队长加入群随时观看公告以便了解最新信息~</p>
    <p>赛前须知：</p>
    <p>0.比赛前或者比赛结束后每组都有资格进入练习赛进行比赛训练，且需要联系各区管理员，练习赛场单独排出。</p>
    <p>1.每个队伍每场比赛有一次暂停比赛的机会，时间最长10min</p>
    <p>2.每个队伍每场比赛有一次举报比赛的机会，且只能在该比赛结束后提出，由管理组进行审核。</p>
    <p>3.每个队伍每场比赛的顺序都是前锋，中坚，大将。</p>
    <p>4.补赛：由于管理组的疏忽或者有人举报导致比赛结果，比赛过程的不公正，在最少两方队伍允许的情况下重赛，时间参考上述补赛时间。</p>
    <p>5.分组固定，不管是什么阶段的赛事，每个阶段的比赛分组都是固定的。</p>
    <p>6.迟到超过30min视为弃权，按照各阶段规定计入败者组或者淘汰。</p>
    <p>7.退赛或者弃权，主动通知的视为弃权，没有通知且不参赛的视为退赛，这两种情况在海选赛，初赛，复活赛中其他队伍直接晋级或者自身不计入排名，复赛按人数计入管理组的替补人员（凑够三队），主赛区同样适用。</p>
    <p>8.补全队伍，每个区域如果在分组时出现人数不够三分，会有专门的替赛人员补全，且替赛人员不计入统计排名</p>
    <p>一．海选赛：</p>
    <p>初始点数120000</p>
    <p>设置击飞（击飞直接结束比赛）</p>
    <p>分组完毕后，前锋，中坚只打一场南风，大将打两场南风，每队一共打四场南风，且分数继承，比赛结束后第三位直接淘汰，取前两位晋级。</p>
    <p>二．初赛：</p>
    <p>初始点数100000</p>
    <p>不设置击飞</p>
    <p>分组完毕后，前锋，中坚只打一场南风，大将打两场南风，每队一共打四场南风，比赛结束后取总分最高的前三位晋级，其他加入败者组。</p>
    <p>三．复赛：</p>
    <p>初始点数120000</p>
    <p>设置击飞（击飞直接结束比赛）</p>
    <p>分组完毕后，每人打两场南风，每队一共打六场南风，比赛结束后取前2位晋级，其他加入败者组。</p>
    <p>四．复活赛：</p>
    <p>初始点数 100000（初赛落败）120000（复赛落败）</p>
    <p>不设置击飞</p>
    <p>分组完毕后，每人打两场南风，每队一共打六场南风，比赛结束后取总分最高1位晋级，其他加入淘汰。</p>
    <p>五．积分循环赛：</p>
    <p>每一轮进行一次随机分组</p>
    <p>初始点数90000 每一轮初始分数为上一轮初始点数+（小组积分*5000）</p>
    <p>分数：每轮比赛1位加2分，2位加1分，三位0分，被打成负分-1</p>
    <p>每一轮前锋，中坚打一场南风，大将打两场南风，第四轮打完后依据最后的点数排名，前三位晋级决赛！</p>
    <p>六．决赛：</p>
    <p>初始点数 100000</p>
    <p>不设置击飞</p>
    <p>分组完毕后，每人打两场南风，每队一共打六场南风，最后按排名分出奖励~</p>
    <p>七．补赛：</p>
    <p>依据各比赛阶段规定比赛</p>
    <p>八．比赛设定规则：</p>
    <p>局数：南风；</p>
    <p>赤宝牌数：2；</p>
    <p>食断：开启；</p>
    <p>*长考时间：5+20s；</p>
    <p>初始点数：100000（调整）；</p>
    <p>一位必要点数：100000（调整）；</p>
    <p>*场点 600</p>
    <p>*立直点数：2000；</p>
    <p>*不听罚符-1人听牌 3000；</p>
    <p>*不听罚符-2人听牌 6000；</p>
    <p>禁止九种九牌流局</p>
    <p>杠表宝牌即开；</p>
    <p>有多倍役满</p>
    <h3>六、[数据删除]</h3>
    <h3>七． 后记</h3>
    <p>Q：为什么是三麻比赛呢？</p>
    <p>A：四麻比赛太多了，想搞点大新闻</p>
    <p>Q：规则太复杂？</p>
    <p>A：三麻规则比较难制定，因为晋级麻烦，还有，规则一定要有趣</p>
    <p>Q：为什么罚符过高（三倍罚符）？</p>
    <p>A：娱乐赛嘛，日就对了（赛事传统</p>
  </div>
</template>

<script>
export default {
  name: "HelloWorld",
  props: {
    msg: String
  }
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
h3 {
  margin: 40px 0 0;
}
ul {
  list-style-type: none;
  padding: 0;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
</style>
